---
kind: method
id: M:Autodesk.Revit.DB.BeamSystem.BeamBelongsTo(Autodesk.Revit.DB.FamilyInstance)
source: html/66187e95-4034-01aa-afc4-5488de3b5414.htm
---
# Autodesk.Revit.DB.BeamSystem.BeamBelongsTo Method

Find out the BeamSystem to which the beam belongs.

## Syntax (C#)
```csharp
public static BeamSystem BeamBelongsTo(
	FamilyInstance beam
)
```

## Parameters
- **beam** (`Autodesk.Revit.DB.FamilyInstance`) - The beam want to ask.

## Returns
The BeamSystem.